CONTRIBUTING.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Contributing Guidelines</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Contributing Guidelines</h1>

<div id="outline-container-orgadb091b" class="outline-2">
<h2 id="orgadb091b">How can I contribute?</h2>
<div class="outline-text-2" id="text-orgadb091b">
<p>
The goal of this project is to enrich the Lisp ecosystem with more resources to help people getting started in the Lisp family of languages.
There are a lot of ways you can contribute to this project. We welcome contributions from all levels and of all kinds.
</p>
</div>

<div id="outline-container-org2622213" class="outline-3">
<h3 id="org2622213">Provide Feedback and Suggestions</h3>
<div class="outline-text-3" id="text-org2622213">
<ul class="org-ul">
<li><b>Constructive Feedback</b>:
You can provide constructive feedback on how to make this content more approachable, beginner-friendly and comprehensive.</li>
</ul>


<ul class="org-ul">
<li><b>Report Issues</b>:
If you find broken links or outdated information, please create and issue so we can fix it.</li>
</ul>


<ul class="org-ul">
<li><b>Start Discussions</b>:
Use the issue tracker to discuss topics, suggest new resources, or propose changes.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb8e2dbc" class="outline-3">
<h3 id="orgb8e2dbc">Share Resources</h3>
<div class="outline-text-3" id="text-orgb8e2dbc">
<ul class="org-ul">
<li><b>Resource Sharing</b>:
If you know of valuable resources related to any Lisp dialect or general programming concepts, please share them. Resources can include websites, articles, books, or videos.</li>
</ul>


<ul class="org-ul">
<li><b>Submit Resources</b>:
Create an issue or pull request with your recommended resources, ensuring they fit well within the existing structure.</li>
</ul>
</div>
</div>

<div id="outline-container-org26a89cf" class="outline-3">
<h3 id="org26a89cf">Write or Modify content</h3>
<div class="outline-text-3" id="text-org26a89cf">
<ul class="org-ul">
<li><b>Create New Content</b>:
If you’re knowledgeable about a specific Lisp dialect(s) or programming concept, consider writing new content.</li>
</ul>


<ul class="org-ul">
<li><b>Improve Existing Content</b>:
If you spot content that could be clearer or more informative, feel free to edit it. We encourage you to create a Pull Request with your changes.</li>
</ul>


<ul class="org-ul">
<li><p>
<b>Writing Format</b>:
We use <a href="https://orgmode.org/">Org Mode</a> as a writing format for this project that is then generated into a static website. You can generate the website locally using Emacs (&gt; 29.3) by running the following command in the project root directory.
</p>

<div class="org-src-container">
<pre class="src src-shell">emacs -q --script publish.el
</pre>
</div>

<p>
This will create folder named <code>public</code> that you can then serve to check how the website will be rendered.
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orgd715ada" class="outline-3">
<h3 id="orgd715ada">Spread the word</h3>
<div class="outline-text-3" id="text-orgd715ada">
<p>
Share the link to this project with more people to help them know about Lisp(s) and how to getting started. Also, you can share it with other Lispers who already know a Lisp or two and are interested in trying others.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
